/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------
题目：二维数组dis[][2]每一行的2个整数表示数轴上的一段区间，例如{1,4}
      表示数轴上起点是1，终点是4的一段区间。不同区间之间存在三种关系：
      1）重叠关系：例如区间{1,4}和{3,6}；
      2）包含关系：例如区间{8,11}和{9,11}；
      3）分离关系：例如区间{15,17}和{18,20}

      dis中的N个区间已经按各区间起点位置升序排序。
      函数int merge(int dis[][2})的功能是将具有重叠和包含关系的两个区间
      合并成一个区间，对分离区间不做处理。

例如：区间{1,4}和{3,6}合并成一个区间{1,6};区间{8,11}和{9,11}合并成一个
      区间{8,11};区间{15,17}和{18,20}不作处理，仍然为两个区间。函数返回
      处理后的区间个数。

程序运行结果如下：
{1,4}{3,6}{8,11}{9,11}{10,14}{15,17}{18,20}
{1,6}{8,14}{15,17}{18,20}
------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
----------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <ctype.h>
#include <string.h>

#define N 7
#define Start 0
#define End 1

int merge(int dis[][2])
{
    int i,j;
    for(j=0,i=1;i<N;++i)
    { 
        if(dis[j][End]>=dis[i][Start])
        {
            if(dis[j][End]<dis[i][End]) 
/**************************SPACE*************************/
            dis[j][End]= dis[i][End];
        }
        else
        {   
            ++j;
            dis[j][Start]=dis[i][Start]; 
            dis[j][End]=dis[i][End]; 
        }
    }
/**************************SPACE*************************/
    return j+1;
}
void print(int dis[][2],int n)
{
    int i;
    for(i=0;i<n;++i)
        printf("{%2d,%2d}",dis[i][0],dis[i][1]);
    printf("\n");
}

int main()
{
    int n;
    int dis[N][2]={{1,4},{3,6},{8,11},{9,11},{10,14},{15,17},{18,20}};
    print(dis,N);
    n=merge(dis);
    print(dis,n);
    return 0;
}
