/*----------------------------------------------------------------------
【程序改错】
------------------------------------------------------------------------
题目：将两个分数之和化简后存放在数组b中，如果和是整数，则以整数形式输出，
      否则以分数形式输出。

例如：二维数组a的第一行存放了4个数，分别是1、6、1、2，表示两个分数1/6，1/2。
      这两个分数之和经化简后为:  2/3，输出为：1/6+1/2=2/3 
      
程序运行结果：
    1/9+5/6=17/18
    1/6+1/2=2/3
    5/2+3/2=4
   
------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
----------------------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<math.h>
#include<ctype.h>
#include<stdlib.h>

void sumx(int a[],int b[])
{
    int fn,fm;
    int x,y,f,gy;
    fn=a[0]*a[3]+a[1]*a[2];
    fm=a[1]*a[3];
    x=fn;y=fm;
/***********FOUND***********/
    while(f=x%y)
    {
        x=y;
        y=f;      
    }
    gy=y;
    b[0]=fn/gy;
    b[1]=fm/gy;
}

int main()
{
    int i,j,a[3][4]={{1,9,5,6},{1,6,1,2},{5,2,3,2}};
    int b[3][2];
    for(i=0;i<3;i++)
    {
 /***********FOUND***********/       
        sumx(a[i],b[i]);
        printf("%d/%d+%d/%d=",a[i][0],a[i][1],a[i][2],a[i][3]);
        printf("%d/%d",b[i][0],b[i][1]);
/***********FOUND***********/    
        if(b[i][1]==1)
            printf("\b\b  ");
        printf("\n");
    }
    return 0;
}
