/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------
题目：某公司的商业数据由长度不超过9位的整数构成，为保守商业秘密，公司对
      数据进行了加密，加密规则如下：
      构成整数的每位数字都加上5除以10的余数代替原数字，从而形成加密后的数字。

例如：原数字如果是: 3712934，则加密后的数字是8267489。

------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
----------------------------------------------------------------------*/
#include <stdio.h>
#include <stdlib.h>
#include <math.h>
#include <ctype.h>
#include <string.h>

#define N 9

int encrypt(int num)
{
    int n=0,i=0,a[N]={0},t=0;
    while(num)
    {
/*******************SPACE*******************/
        a[n]=((num%10)+5)%10;   
        num=num/10;
        n++;
    }
    for(i=0; i<n; i++)
 /*******************SPACE*******************/
        t=t*10+a[n-i-1];
    return t;
}

int main()
{
    int num=3712934;
    printf("\n加密后的数是: %d\n",encrypt(num));
}
