/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------
题目：输出100以内的梅森素数。梅森素数是指等于2的整数次幂减1的素数。
例如：7是梅森素数，它等于2的3次方减1。
      程序运行结果为：
         3=2^2-1
         7=2^3-1
         31=2^5-1
------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
----------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <math.h>
int  msprime(int  m )
{  
    int i = 2,k,p;
    while ( i <= m && (m%i))
        i++;
/*************************SPACE*************************/
    if(i>=m)
    {
        for(k=1;;k++)
        {                 
            p=pow(2,k)-1;
/*************************SPACE*************************/                   
            if(p>m)
                break;
            else if(p==m)
                return k;
        }          
    }
    return  0;
}
int main()
{
    int m,k; 
    for(m=2;m<=100;m++)
        if (k=msprime(m))
            printf("%d=2^%d-1\n",m,k);
    return 0;
}
