/*----------------------------------------------------------------------
【程序填空】
------------------------------------------------------------------------
题目：求200-2000之内的亲密数对。“亲密数对”是指两个整数A和B，A的所有因子
      （包含1但不包含其本身）之和等于B，且B的所有因子（包含1但不包含其本身）
      之和等于A。
      程序运行结果为：
      [220,284]
      [1184,1210]
------------------------------------------------------------------------
注意：除要求填空的位置之外，请勿改动程序中的其他部分。
----------------------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<math.h>
#include<ctype.h>
#include<stdlib.h>

int fun(int n)
{
    int i,sum=0;
    for(i=1;i<=n/2;i++)
    {
/**************************SPACE*************************/
        if(n%i==0)
        {
            sum+=i;
                        
        }
    }
    return sum;
}
int main()
{
    int a,b,n;
    for(a=200;a<=2000;a++)
    {
        b=fun(a);
/**************************SPACE*************************/
        if(a==fun(b)&&a<b)
            printf("[%d,%d]\n",a,b);
    }
    return 0;
}
