/*----------------------------------------------------------------------
【程序改错】
------------------------------------------------------------------------
题目：将5个整数转换为数字字符串存入字符串s中，
5个数字字符串间用1个空格
      分隔，字符串s中的数据与原有整数次序一致，且字符串右对齐。

      程序运行结果为：
|-----------------------------|
|        -23 672 -1256 7 53248|

------------------------------------------------------------------------
注意：不得增行或删行，也不得更改程序的结构。
----------------------------------------------------------------------*/
#include<stdio.h>
#include<string.h>
#include<math.h>
#include<ctype.h>
#include<stdlib.h>

#define LEN 30 

void change(char s[],int in[],int n)
{
    int i,k,pos,sign;
/***********FOUND***********/
    pos=LEN;
    for(i=n-1;i>=0;--i)
    {
        k=in[i];
        sign=1;
        if(k<0)
        {
            k=-k;
            sign=1-sign;
        }
        for(;k;k/=10)
            s[pos--]=k%10+'0';
        if(sign==0)
/***********FOUND***********/
            s[pos--]='-';
        s[pos--]=' ';
    }
    for(;pos>=0;--pos)
/***********FOUND***********/
        s[pos]=' ';
}

int main()
{
    int in[5]={-23,672,-1256,7,53248};
    char s[LEN]={0};
    change(s,in,5);
    printf("|-----------------------------|\n");
printf("|%s|\n",s);
    return 0;
}
